#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cloudnat-gke-netherlands.google_compute_address.address[0] will be created
  + resource "google_compute_address" "address" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "nat-external-address-europe-west4-a"
      + network_tier       = (known after apply)
      + project            = "sander-gke-project"
      + purpose            = (known after apply)
      + region             = "europe-west4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.cloudnat-gke-netherlands.google_compute_address.address[1] will be created
  + resource "google_compute_address" "address" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "nat-external-address-europe-west4-b"
      + network_tier       = (known after apply)
      + project            = "sander-gke-project"
      + purpose            = (known after apply)
      + region             = "europe-west4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.cloudnat-gke-netherlands.google_compute_address.address[2] will be created
  + resource "google_compute_address" "address" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "nat-external-address-europe-west4-c"
      + network_tier       = (known after apply)
      + project            = "sander-gke-project"
      + purpose            = (known after apply)
      + region             = "europe-west4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.cloudnat-gke-netherlands.google_compute_router.router will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cloud-router-europe-west4"
      + network            = "network-gke"
      + project            = "sander-gke-project"
      + region             = "europe-west4"
      + self_link          = (known after apply)
    }

  # module.cloudnat-gke-netherlands.google_compute_router_nat.advanced-nat will be created
  + resource "google_compute_router_nat" "advanced-nat" {
      + icmp_idle_timeout_sec              = 30
      + id                                 = (known after apply)
      + name                               = "nat-europe-west4"
      + nat_ip_allocate_option             = "MANUAL_ONLY"
      + nat_ips                            = (known after apply)
      + project                            = "sander-gke-project"
      + region                             = "europe-west4"
      + router                             = "cloud-router-europe-west4"
      + source_subnetwork_ip_ranges_to_nat = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec   = 1200
      + tcp_transitory_idle_timeout_sec    = 30
      + udp_idle_timeout_sec               = 30

      + log_config {
          + enable = true
          + filter = "ERRORS_ONLY"
        }
    }

  # module.gke_web_stg_container_cluster.google_container_cluster.primary will be updated in-place
  ~ resource "google_container_cluster" "primary" {
        additional_zones            = [
            "europe-west4-a",
            "europe-west4-b",
            "europe-west4-c",
        ]
        cluster_ipv4_cidr           = "10.1.128.0/17"
        default_max_pods_per_node   = 110
        enable_binary_authorization = false
        enable_intranode_visibility = false
        enable_kubernetes_alpha     = false
        enable_legacy_abac          = false
        enable_shielded_nodes       = false
        enable_tpu                  = false
        endpoint                    = "35.204.240.180"
        id                          = "gke"
        initial_node_count          = 1
        instance_group_urls         = [
            "https://www.googleapis.com/compute/beta/projects/sander-gke-project/zones/europe-west4-a/instanceGroups/gke-gke-pool-1-cc5918ff-grp",
            "https://www.googleapis.com/compute/beta/projects/sander-gke-project/zones/europe-west4-b/instanceGroups/gke-gke-pool-1-e6e407ec-grp",
            "https://www.googleapis.com/compute/beta/projects/sander-gke-project/zones/europe-west4-c/instanceGroups/gke-gke-pool-1-884956c2-grp",
        ]
        ip_allocation_policy        = [
            {
                cluster_ipv4_cidr_block       = "10.1.128.0/17"
                cluster_secondary_range_name  = "pods"
                create_subnetwork             = false
                node_ipv4_cidr_block          = "10.1.64.0/18"
                services_ipv4_cidr_block      = "10.1.0.0/19"
                services_secondary_range_name = "services"
                subnetwork_name               = ""
                use_ip_aliases                = true
            },
        ]
        location                    = "europe-west4"
        logging_service             = "logging.googleapis.com"
        master_version              = "1.14.10-gke.34"
        min_master_version          = "1.14"
        monitoring_service          = "monitoring.googleapis.com"
        name                        = "gke"
        network                     = "projects/sander-gke-project/global/networks/network-gke"
        node_locations              = [
            "europe-west4-a",
            "europe-west4-b",
            "europe-west4-c",
        ]
        node_version                = "1.14.10-gke.34"
        project                     = "sander-gke-project"
        region                      = "europe-west4"
        remove_default_node_pool    = true
        resource_labels             = {}
        services_ipv4_cidr          = "10.1.0.0/19"
        subnetwork                  = "projects/sander-gke-project/regions/europe-west4/subnetworks/sn-gke"

        addons_config {
            cloudrun_config {
                disabled = false
            }

            horizontal_pod_autoscaling {
                disabled = false
            }

            http_load_balancing {
                disabled = false
            }

            istio_config {
                disabled = true
            }

            kubernetes_dashboard {
                disabled = true
            }

            network_policy_config {
                disabled = false
            }
        }

        cluster_autoscaling {
            enabled = false
        }

        database_encryption {
            state = "DECRYPTED"
        }

        maintenance_policy {
            daily_maintenance_window {
                duration   = "PT4H0M0S"
                start_time = "03:00"
            }
        }

        master_auth {
            cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURDekNDQWZPZ0F3SUJBZ0lRTkZrRVEwSEwrUlJDTTVaU3h5cmpJREFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlRelpXWmxZbU5pTkMwME5EWTJMVFEwTXprdFlUWmpaaTA0WldKbVl6WTNOek0xWmpndwpIaGNOTWpBd05ESXhNVGd6TmpFNVdoY05NalV3TkRJd01Ua3pOakU1V2pBdk1TMHdLd1lEVlFRREV5UXpaV1psClltTmlOQzAwTkRZMkxUUTBNemt0WVRaalppMDRaV0ptWXpZM056TTFaamd3Z2dFaU1BMEdDU3FHU0liM0RRRUIKQVFVQUE0SUJEd0F3Z2dFS0FvSUJBUUN1SThuOXptdS9Yay9hNEg2eHpxanJDVE85TTVjVUdWdkpIdTRncjhsNApLTXNWNEFHbW5pRjdyS2w1TVBUQ1lha0s4S2JiTEZKMkZKUmkrVU5jWnFMUnFMWlR0eFNVNG1OSWYrZEpiZGhsCnkvVWFJUXFoaVNvT3RlS0k4bm15aDlLV2VHUnlkaGcrWkY2Y3cvanlzZnh6WjJUTWt6QkpCRW1Pc01FbWFxaFYKNnBpdmZ6ZHdXdWhheGE2VklqQmh3MUpwb1R6SUJNTDMyL0lmWHUzRTArMmpRY0pydzdDaDFEWUhWbmhaMXZDZgpZblNweHNUVWVudjhtSElBT2xKTGxtUWNVTk42YStnUDRDdzcxZ1l0bDYyYWRUVXR3N3A1SEt1ZFZzOHVIVEFHCktYMUVIZ1dYNnBxZ0dnWWtCc0czUVdNWEFkNytRSHBTUjVUWEhMRS9qQ1F6QWdNQkFBR2pJekFoTUE0R0ExVWQKRHdFQi93UUVBd0lDQkRBUEJnTlZIUk1CQWY4RUJUQURBUUgvTUEwR0NTcUdTSWIzRFFFQkN3VUFBNElCQVFCYgpyaTUwc1c1TVpkOEo3RHFQbEw1U0tjQUQ4b2tVS3ZEY0d6WWpoT05uYUl2SEVmb3BaVURiSm1LYXQwbTNpcXA4Cm1VdlAwRndoK1MweHR1bTFYOW80bkhIcXVoUE9xaEppdUR3dXdBcjE3MFlickY3OTB0a1J0SUx5UjlZMmVZMTMKM0dTNlVZdUI3Ymd5MzVsZVR2Q0pJQU1nREZNZEpiZ0Q3Sy84aWx3L3JSZGZ0azMwUzBFZkdWcEgvcC8xb1kwMwo0OXV1b1NvcVczaU5BQmVZMmRxUWkrY3QyVmRTeEJ1cmZsTGh0aC9jRGxjYXdrcGlHM1M5YlNjcW9ycmkybUx0CjUyTlBtcVBMT2gzQ1NqVGgxdGdOYmZwQ01nYTROaGc3WHVDbEFLNHhqcEd3UkRHaXI5RSt2MGt5UUZSNncrQlgKc0ozWG04cHhIdk0xZFlOd3RMZkYKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="

            client_certificate_config {
                issue_client_certificate = false
            }
        }

      ~ master_authorized_networks_config {
          + cidr_blocks {
              + cidr_block   = "109.249.184.194/32"
              + display_name = "Home"
            }
          - cidr_blocks {
              - cidr_block   = "167.98.129.192/29" -> null
              - display_name = "London Office" -> null
            }
        }

        network_policy {
            enabled  = true
            provider = "CALICO"
        }

        node_config {
            disk_size_gb      = 100
            disk_type         = "pd-standard"
            guest_accelerator = []
            image_type        = "COS"
            labels            = {}
            local_ssd_count   = 0
            machine_type      = "n1-standard-2"
            metadata          = {
                "disable-legacy-endpoints" = "true"
            }
            oauth_scopes      = [
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
                "https://www.googleapis.com/auth/monitoring",
                "https://www.googleapis.com/auth/service.management.readonly",
                "https://www.googleapis.com/auth/servicecontrol",
                "https://www.googleapis.com/auth/trace.append",
            ]
            preemptible       = false
            service_account   = "default"
            tags              = []

            shielded_instance_config {
                enable_integrity_monitoring = true
                enable_secure_boot          = false
            }
        }

        node_pool {
            initial_node_count  = 1
            instance_group_urls = [
                "https://www.googleapis.com/compute/v1/projects/sander-gke-project/zones/europe-west4-a/instanceGroupManagers/gke-gke-pool-1-cc5918ff-grp",
                "https://www.googleapis.com/compute/v1/projects/sander-gke-project/zones/europe-west4-b/instanceGroupManagers/gke-gke-pool-1-e6e407ec-grp",
                "https://www.googleapis.com/compute/v1/projects/sander-gke-project/zones/europe-west4-c/instanceGroupManagers/gke-gke-pool-1-884956c2-grp",
            ]
            max_pods_per_node   = 110
            name                = "pool-1"
            node_count          = 1
            node_locations      = [
                "europe-west4-a",
                "europe-west4-b",
                "europe-west4-c",
            ]
            version             = "1.14.10-gke.34"

            management {
                auto_repair  = true
                auto_upgrade = true
            }

            node_config {
                disk_size_gb      = 100
                disk_type         = "pd-standard"
                guest_accelerator = []
                image_type        = "COS"
                labels            = {}
                local_ssd_count   = 0
                machine_type      = "n1-standard-2"
                metadata          = {
                    "disable-legacy-endpoints" = "true"
                }
                oauth_scopes      = [
                    "https://www.googleapis.com/auth/devstorage.read_only",
                    "https://www.googleapis.com/auth/logging.write",
                    "https://www.googleapis.com/auth/monitoring",
                    "https://www.googleapis.com/auth/service.management.readonly",
                    "https://www.googleapis.com/auth/servicecontrol",
                    "https://www.googleapis.com/auth/trace.append",
                ]
                preemptible       = false
                service_account   = "default"
                tags              = []

                shielded_instance_config {
                    enable_integrity_monitoring = true
                    enable_secure_boot          = false
                }
            }
        }

        release_channel {
            channel = "UNSPECIFIED"
        }

        timeouts {
            create = "30m"
            delete = "30m"
            update = "30m"
        }
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Warning: Quoted references are deprecated

  on .terraform/modules/gke_web_stg_container_cluster/container_cluster/main.tf line 2, in resource "google_container_cluster" "primary":
   2:   provider                    = "google-beta"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

```

</details>

*Workflow: `Terraform`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
